# Напишите функцию filtered.sum, которая на вход получает вектор с пропущенными, положительными и отрицательными значениями и возвращает сумму положительных элементов вектора.

# Sample Input:

# -0.446 24.045 -25.312 -20.758 -57.250 23.893 43.509 9.238 3.317 -6.416 5.353 -22.099 -28.201 -20.506 -22.656 -28.038 -19.538 -9.467 2.266 10.303 -25.728 -7.256 NA NA NA NA 12.886 NA NA NA 28.091 NA -10.556 -6.063 46.757 NA -21.088 -35.371 35.495 -7.374

# Sample Output:

# 245.153

filtered.sum <- function(x){
  sum <- 0
  for (j in 1:length(x))
  {
    if (is.na(x[j]) == 0 & x[j] > 0)
    {
      sum <- sum + x[j]
    }
  }
  return(sum)
}

my_vector <- c(17,18,17,18,17.5,25)
filtered.sum(my_vector)