# Напишите функцию, которая выводит номера позиций пропущенных наблюдений в векторе.

# На вход функция получает числовой вектор с пропущенными значениями. Функция возвращает новый вектор с номерами позиций пропущенных значений.

# > my_vector <- c(1, 2, 3, NA, NA)
# > NA.position(my_vector)
# [1] 4 5

# Sample Input:

# -14.647 14.694 -23.670 -23.004 10.394 -26.531 16.946 18.815 4.046 -19.957 -6.705 -13.232 1.179 17.523 5.154 -3.417 27.175 11.959 32.156 7.233 NA 1.235 NA 14.713 NA 19.890 14.116 -6.102 NA -17.916 NA -10.000 NA NA NA NA NA NA NA NA

# Sample Output:

# 21 23 25 29 31 33 34 35 36 37 38 39 40

NA.position <- function(x){
  res <- 1
  pos <- 1
  for (j in 1:length(x))
  {
    if (is.na(x[j]))
    {
      res[i] <- j
      pos <- pos + 1
    }
  }
  return(res)
}

my_vector <- c(1, 2, 3, NA, NA, NA)
NA.position(my_vector)