// В классе «Мультимножество целых чисел» – Multiset перегрузить операции сложения, вычитания, умножения (пересечения), индексирования, присваивания и вывода на экран. Создать массив объектов и передавать пары объектов в функцию, которая строит мультимножество, состоящее из элементов, входящих только в одно из заданных множеств, т. е.  ( A∪B) \ (A∩B), и возвращает его в основную программу (использовать при этом реализованные перегруженные операции).

// Sample Input:

// (1,2,3,4),(2,3,5,6)

// Sample Output:

// (1,4,5,6)

#include <iostream>

int main() {
  // put your code here
  return 0;
}