// Реализовать шаблонный класс «Упорядоченное бинарное дерево» – Tree. Тип хранимых в дереве ключей – параметр шаблона. Написать несколько конструкторов, в том числе конструктор копирования. В классе реализовать методы для вставки элемента в дерево, удаления элемента по ключу, поиска элемента по ключу, вывода на экран. Перегрузить операции сложения, вычитания, присваивания и вывода на экран. Cформировать дерево, вывести содержимое листьев дерева (вершин, не имеющих потомков) в порядке возрастания ключей.

// Sample Input:

// 2,3,5,1,4,9

// Sample Output:

// 1,4,9

#include <iostream>

int main() {
  // put your code here
  return 0;
}