// Реализовать в шаблонном классе-контейнере «Комплексное число» – Complex обработку ошибочных ситуаций с помощью аппарата исключений (try-throw-catch). ;Типы действительной и мнимой части должны быть параметрами шаблона. Класс должен содержать несколько конструкторов. В классе реализовать методы для сложения, вычитания, умножения и вывода на экран. Перегрузить операции для сложения, вычитания, умножения, присваивания и вывода на экран. Создать два вектора размерности n из комплексных координат. Передать их в функцию, которая выполняет сложение комплексных векторов.

// Sample Input:

// [(1,2),(3,4),(2,3)],[(1,1),(2,2),(3,3)]

// Sample Output:

// [(2,3),(5,6),(5,6)]