// Используя средства библиотеки STL написать функцию с параметром, представляющим собой контейнер-список указателей на элементы длинного целого типа. Функция, просматривает контейнер от конца к началу и меняет знак значения, на которое указывает текущий указатель, если следующее за ним значение отрицательно. Например, список (-1,-2,3,4) превратится в (-1,2,-3,4). Затем функция печатает значения, на которые указывают элементы контейнера в прямом порядке. Функция возвращает число измененных элементов.

// Sample Input:

// (-1,-2,3,4)

// Sample Output:

// (-1,2,-3,4)