// Для ε=1, ε=0,1 и ε=0,001 найдите соответствующие номера n, начиная с которых будет выполняться неравенство 5n/sqrt(n)<ε. В ответе приведите числа, разделенные пробелами.
// 26 2501 25000001

#include <iostream>
#include <iomanip>
#include <cmath>

int main()
{
    double x = 0.0;
    size_t a[3] = {};
    for (size_t n = 1; n < 25000002; ++n) {
        x = (double)5 / sqrt(n);
        if (x < 1 && a[0] == 0)
            a[0] = n;
        if (x < 0.1 && a[1] == 0)
            a[1] = n;
        if (x < 0.001 && a[2] == 0)
            a[2] = n;
    }
    std::cout << a[0] << " " << a[1] << " " << a[2] << "\n";
    return 0;
}