# Пусть А = {1,2,3,4,5,6,7}, В = {4,5,6,7,8,9,10}, С = {2,4,6,8,10}, а U = {1,2,3,4,5,6,7,8,9,10}. Определите (A∪B)∩(U∖C).

# В качестве ответа перечислите элементы множества через пробел. Например:
# 1 2 3 4
# https://www.wolframalpha.com/input/?i=%28%7B1%2C2%2C3%2C4%2C5%2C6%2C7%7D+union+%7B4%2C5%2C6%2C7%2C8%2C9%2C10%7D%29+intersect+%28%7B1%2C2%2C3%2C4%2C5%2C6%2C7%2C8%2C9%2C10%7D+%5C+%7B2%2C4%2C6%2C8%2C10%7D%29

a = set([1,2,3,4,5,6,7])
b = set([4,5,6,7,8,9,10])
u = set([1,2,3,4,5,6,7,8,9,10])
c = set([2,4,6,8,10])

(a | b) & (u-c)
