# Предлагаем вам решить задачу про лягушек, сформулированную в первом степе. Постарайтесь получить замкнутую формулу для n-го члена последовательности.

# В качестве ответа укажите значение этой формулы при n=1/2 . Ответ округлите до целого числа.

# Подсказка: рекуррентное соотношение в этой задаче является неоднородным. Чтобы избавиться от неоднородности, сделайте замену переменной: a^n=an+c .

http://www.wolframalpha.com/input/?i=a%28n%2B1%29%3D4*a%28n%29-100%2C+a%280%29%3D50

http://www.wolframalpha.com/input/?i=%2850%2F3%29*%284%5E%281%2F2%29%2B2%29