# Последовательностью степеней вершин графа называется список всех степеней его вершин, записанных в порядке невозрастания.
# Например для графа G, приведенного на рисунке, последовательность степеней вершин выглядит так:

# 5 4 4 3

# Какие из представленных числовых последовательностей могут быть последовательностью степеней вершин какого-нибудь графа?

Последовательность, являющаяся последовательностью степеней какого-либо графа, называется графической (англ. graphical sequence). Из формулы суммы степеней следует, что любая последовательность с нечётной суммой (как, к примеру, 3, 3, 1) не может быть последовательностью степеней графа. Обратное также верно: если последовательность имеет чётную сумму, она представляет собой последовательность степеней мультиграфа. Построение такого графа осуществляется достаточно простым способом: необходимо объединить вершины нечётных степеней в пары, к оставшимся незаполненными вершинам следует добавить петли.