Дан граф на восьми вершинах. Известно, что все его вершины имеют степень, меньшую или равную k. Известно также, что между любой парой вершин графа существует путь длины один или два. При каком минимальном значении k это возможно?


Количество ребер в полном графе на n вершинах равно n(n − 1)/2:
n(n-1)/2 = для 8 вершин это 28 ребер

Степенью вершины называется количество ребер, выходящих из этой вер-
шины. Если это количество четно, то вершина называется четной, в противном случае вершина
называется нечетной. Сумма степеней всех вершин графа равна удвоенному количеству всех ребер.

56 сумма степеней для графа из 8 вершин.
