// Дано число N. Определите, сколькими способами можно расставить на доске N×N N ферзей, не бьющих друг друга.
// Формат входных данных

// Задано единственное число N. (N ≤ 10)
// Формат выходных данных
// Выведите ответ на задачу.
// Подсказка
// Напишите рекурсивную функцию, которая пытается поставить ферзя в очередной столбец. Если на эту клетку ставить ферзя нельзя (он бьет предыдущих), то такой вариант даже не стоит рассматривать. Когда вы успешно поставили ферзя в последний столбец - увеличивайте счетчик.

// Sample Input:

// 8

// Sample Output:

// 92