# По предложенной выборке постройте гистограмму, используя интервалы
# [15, 15.75], (15.75, 16.5], (16.5, 17.25], (17.25, 18.0], (18.0, 18.75], (18.75, 19.5], (19.5, 20.25], (20.25, 21.0]
# Найдите относительные частоты попадания элементов выборки в данные интервалы.

# Формат ответа: относительные частоты с точностью до третьего знака после запятой через запятую с пробелом

# Sample Input:

# 18.55, 16.5, 18.09, 19.17, 17.09, 18.16, 16.09, 18.79, 17.44, 17.92

# Sample Output:

# 0.000, 0.200, 0.100, 0.200, 0.300, 0.200, 0.000, 0.000

x <- c(19.92, 17.07, 18.75, 18.87, 16.21, 19.59, 18.58, 17.13, 17.74, 16.78, 18.36, 19.96, 17.11, 17.63, 18.25, 17.27, 18.36, 18.77, 17.58, 18.12, 17.22, 18.41, 20.04, 16.42, 17.93, 16.98, 17.63, 17.39, 18.27, 18.78, 18.87, 17.78, 20.02, 17.37, 18.29, 16.91, 17.75, 17.6, 17.59, 18.33)
print(table(cut(x, c(15, 15.75))))
print(table(cut(x, c(15.75, 16.5))))
print(table(cut(x, c(16.5, 17.25))))
print(table(cut(x, c(17.25, 18.0))))
print(table(cut(x, c(18.0, 18.75))))
print(table(cut(x, c(18.75, 19.5))))
print(table(cut(x, c(19.5, 20.25))))
print(table(cut(x, c(20.25, 21.0))))


# 0.000, 0.200, 0.700, 1.200, 1.000, 0.400, 0.500, 0.000
