# В переменной my_vector сохранен вектор из 50 чисел.

# Решите задачу используя конструкцию:

# if () {

# } else {

# }

# Рассчитайте среднее значение вектора, напечатайте "My mean is great", если среднее по выборке больше 20 и  "My mean is not so great", если среднее значение меньше или равно 20

# Sample Input:

# 13.38 23.86 23.24 26.48 26.01 10.28 13.44 26.67 15.87 20.03 9.53 11.94 17.43 24.17 17.87 13.9 15.0 14.89 20.46 19.54 22.53 28.09 9.81 17.74 26.36 24.29 15.63 13.16 23.8 23.92 16.75 25.56 21.82 21.78 16.87 21.31 24.7 26.02 16.52 32.24 16.49 16.2 20.2 23.86 23.72 14.91 13.7 18.74 20.84 25.41

# Sample Output:

# My mean is not so great

my_vector  <- c(13.38,23.86,23.24,26.48,26.01,10.28,13.44,26.67,15.87,20.03,9.53,11.94,17.43,24.17,17.87,13.9,15.0,14.89,20.46,19.54,22.53,28.09,9.81,17.74,26.36,24.29,15.63,13.16,23.8,23.92,16.75,25.56,21.82,21.78,16.87,21.31,24.7,26.02,16.52,32.24,16.49,16.2,20.2,23.86,23.72,14.91,13.7,18.74,20.84,25.41)

if (mean(my_vector) >= 20) {
    print('My mean is great')
} else {
    print('My mean is not so great')
}
