# В переменной my_vector сохранен вектор с пропущенными значениями. Замените все пропущенные значения вектора на среднее значение по имеющимся наблюдениям.

# Напечатайте новый вектор при помощи функции print().

# Sample Input:

# 18 16 24 25 21 13 24 22 23 17 20 14 17 13 19 17 19 15 20 15 NA 18 23 22 NA 19 16 20 NA NA NA NA 14 NA NA 23 NA NA NA NA

# Sample Output:

# 18.0 16.0 24.0 25.0 21.0 13.0 24.0 22.0 23.0 17.0 20.0 14.0 17.0 13.0 19.0 17.0 19.0 15.0 20.0 15.0 18.8214 18.0 23.0 22.0 18.8214 19.0 16.0 20.0 18.8214 18.8214 18.8214 18.8214 14.0 18.8214 18.8214 23.0 18.8214 18.8214 18.8214 18.8214

my_vector[is.na(my_vector)] <- mean(my_vector, na.rm=TRUE)
print(my_vector)