// Задача 1. Вам дана программа. Отметьте строчки с ошибками.

#include <iostream>
int main(int argc, char **argv) {
    cout << "hello, world!" << endl;
    return 0;
}

// 5